from random import choice
from time import sleep
print("欢迎来到沙雕故事生成器！")
sleep(0.5)
while True:
    while True:
        user=input("请在此输入您的名字（或者您的损友名字）：").strip()
        print()
        if user:
            break
        print("名字不能为空！")
        print()
        sleep(0.3)
    
    A=["隔壁老王","你的数学试卷","杜甫","小明","小红","网吧小哥","你家的洗脸盆","你的老板","你的手机","您的八辈祖宗",\
       "秦始皇","deepseek","奥特曼","光头强"]
    a=["和","催促","怂恿","教","惩罚","鼓励","强迫"]
    B=["在二中门口","在春晚直播现场","在抖音上","在冰箱里","用WIFI信号","在教堂","在清华大学","趁着双11",\
       "在高考考场","在鬼屋","在喜羊羊与灰太狼第7集","在我的世界登录界面","在飞机上"]
    C=["求拼多多砍一刀","跳全国中小学生广播体操《七彩阳光》","接吻","玩王者荣耀","一起唱“super idol的笑容都没你的甜”",\
       "把大象塞进冰箱","互相叫爸爸","学海豚音","吃老坛酸菜面","踢飞大头儿子和小头爸爸","修炼辟邪剑谱",\
       "叫挖掘机炒菜","给卫星贴膜","唱跳rap篮球","比赛跑800米"]
    D=["不建议这样做...","可以试逝","你想干嘛","python大舞台，有梦你就来","看不下去","6","好好好这么玩是吧",\
       f"{choice(A)}的40m大刀已放在您家门口，请注意查收。",f"{choice(A)}已哭晕在厕所。","这合理吗？","那很合理了",\
       "难蚌","啊？","逆天"]
    story=f"{user}{choice(a)}{choice(A)}{choice(B)}偷偷{choice(C)}。"
    sleep(0.3)
    print(story)
    sleep(4)
    print(f"系统提示：{choice(D)}")
    print()
    sleep(2)
