anwsers=["只有放弃追问，答案才会显现。","先找到一只黑猫，答案在它的眼睛里。",\
         "不如先点杯奶茶再思考。"  ,"这个问题价值10根辣条。",\
         "系统提示：答案需要VIP充值。", "建议你问问隔壁家的狗。",\
         "答案取决于你如何定义问题。","真正的答案在问题之外。",\
         "你其实早就知道，只是不愿承认。","宇宙尚未准备好回答这个。",\
         "答案在冰箱第三格。",
"404 Answer Not Found.","此问题已被AI标记为‘过于危险’。",\
"像你这样的天才不需要答案！",\
 "答案藏在你的勇气里。",\
 "命运正在为你重写剧本。"\
 "需要掷三次骰子才能解密。",\
"尝试新路径。",\
"等待转机。",\
"时间会证明。",\
"量变带来质变。",\
"你需要了解更多信息。",\
"把握现在。"\
"不必为了你无法控制的事情担心。",\
"不要忘记微笑。",\
"且行且思。",\
"做最重要的决定。",\
"你或许需要突破。",\
"换一个方向。",\
"你说了算。",\
"准备迎接意料之外的结果。",\
"别要求太多。",\
"问问自己为什么要问这个问题？",\
"令人期待的事情马上就会发生。",\
"相信你最初的想法。",\
"眼光长远一点。",\
"开心就好。",\
"灵活应对。",\
"以更放松的态度面对。",\
"先做重要的事情。",]

from time import sleep
from random import choice
print("欢迎来到答案之书！")
print()

while True:
    input("在此输入你想问的任何问题：")
    print("答案之书正在翻动......")
    sleep(3)
    print(choice(anwsers))
    print()
    
    


